import React, { Component } from 'react';
import { Switch, Route } from 'react-router-dom';

import MovieList from './components/MovieList';
import MovieDetail from './components/MovieDetail';
import MoviePurchaseConfirm from './components/MoviePurchaseConfirm';
import NotFound from './components/NotFound';

class App extends Component {
  render() {
    const data = [
      {
        id: 1,
        title: 'Avengers Endgame',
        subtitle: 'อเวนเจอร์ส เผด็จศึก',
        detail:
          'Avengers: ENDGAME  เรื่องราวการปิดจักรวาลมาร์เวลเฟส 3 เหตุการณ์ภายหลังจากที่ธานอสดีดนิ้วล้างครึ่งจักรวาล เหล่าฮีโร่ที่เหลือรอดจะหาทางกอบกู้จักรวาลนี้คืนมาได้อย่างไร โดยในภาคนี้จะมีตัวเด็ดอย่างกัปตันมาร์เวลมาร่วมเสริมทัพด้วย',
        release_date: '24 เมษายน 2019',
        image:
          'https://cdn.majorcineplex.com/uploads/movie/2584/thumb_2584.jpg?1556025304',
        price: 200,
      },
      {
        id: 2,
        title: 'Okko Inn',
        detail:
          'สตูดิโอ Madhouse\nขอต้อนรับทุกท่านสู่โรงแรมที่จะเยียวยาหัวใจของทุกคน แม้กระทั่งผี!\nพบกับผลงานที่สร้างโดยทีมงาน Ghibli บอกเล่าเรื่องราวของ อ๊กโกะ\nเด็กสาวที่ต้องย้ายมาอยู่กับย่าหลังจากที่พ่อและแม่ของเธอเสียชีวิต\nย่าของเธอเป็นเจ้าของโรงแรมเรียวกังซึ่งเป็นที่ตั้งของบ่อออนเซ็นที่เล่าขา\nนว่ามีสรรพคุณในการรักษาเยียวยา\nในขณะที่เธอกำลังปรับตัวให้เข้ากับชีวิตในที่อยู่แห่งใหม่\nเธอก็พบว่าเธอเป็นคนเดียวที่สามารถมองเห็นวิญญาณที่อาศัยอยู่ในที่แห่ง\nนี้ เรื่องราวอลวนสุดน่ารักระหว่างคนและผีจึงได้เริ่มต้นขึ้น',
        subtitle: 'บอสวัยใสกับวิญญาณอลเวง',
        release_date: '25 เมษายน 2019',
        image:
          'https://cdn.majorcineplex.com/uploads/movie/2662/thumb_2662.jpg?1556901593',
        price: 160,
      },
      {
        id: 3,
        title: 'The Curse of the Weeping Woman',
        subtitle: 'คำสาปมรณะจากหญิงร่ำไห้',
        detail:
          'เรื่องราว ลาโยโรนา หญิงร่ำไห้ วิญญาณร้าย เธอติดอยู่ในโชคชะตาอันเลวร้ายที่เกิดขึ้นจากน้ำมือของตนเอง คำกล่าวขานเรื่องราวของเธอโด่งดังทั่วโลกมายาวนาน เมื่อยามมีชีวิต เธอกดลูกตัวเองจมน้ำจากความโกรธแค้น และกระโดดลงสู่สายน้ำอันปั่นป่วนขณะร่ำไห้อย่างเจ็บปวด ยามนี้ เธอร่ำไห้นิรันดร และหากใครที่ได้ยินเสียงเพรียกแห่งความตายยามค่ำคืนของเธอต้องพบจุดจบ เธอคืบคลานในความมืด เรียกร้องหาเด็ก ๆ เพื่อนำมาแทนที่ลูกของตน ยิ่งเวลาผ่านไปนับศตวรรษ ความปรารถนาของเธอกลับยิ่งเพิ่มมากขึ้น รุนแรงยิ่งขึ้น และวิธีการของเธอก็น่ากลัวยิ่งขึ้นทุกที่\nปี 1970 ที่ลอสแองเจลิส ลาโยโรนา แฝงกายในความมืด ติดตามเด็กชายที่ไม่สนใจฟังคำเตือนอันน่าขนลุกของนักสังคมสงเคราะห์สาวผู้เป็นมารดา ที่คาดว่าลูกของตนกำลังอยู่ในอันตราย ไม่ช้าเธอและลูกของเธอก็ถูกดึงเข้าสู่ดินแดนเหนือธรรมชาติสุดสะพรึง ซึ่งเธอคิดว่า ความหวังเพียงหนึ่งเดียวของพวกเธอที่จะรอดจากความแค้นของ La Llorona อาจเป็นนักบวชผู้ไม่แยแสโลกและฝึกฝนเวทมนตร์เพื่อรับมือปีศาจนั่นเอง',
        release_date: '17 เมษายน 2019',
        image:
          'https://cdn.majorcineplex.com/uploads/movie/2529/thumb_2529.jpg?1555620789',
        price: 150,
      },
      {
        id: 4,
        title: 'Five Feet Apart',
        subtitle: 'ขออีกฟุตให้หัวใจเราใกล้กัน',
        detail:
          'จะรักกันได้อย่างไรในเมื่อเราสัมผัสกันไม่ได้? สเตลล่า (เฮลีย์ ลู ริชาร์ดสัน) และ วิล (โคล สเปราส์) หนุ่มสาววัยสิบเจ็ดที่ตกหลุมรักกัน พวกเขาจีบกันเหมือนวัยรุ่นทั่วไป แอบทำอะไรเมื่อพ้นสายตาผู้ใหญ่ แต่ความสัมพันธ์นี้เกิดขึ้นบนพื้นฐานที่ว่าพวกเขาเป็นผู้ป่วยโรคซิสติก ไฟรโบรซิส ที่รักษาตัวอยู่ในโรงพยาบาลเดียวกัน โดยมีกฏสำคัญว่าพวกเขาห้ามเข้าใกล้กันกว่าห้าฟุตโดยเด็ดขาด เมื่อความผูกพันระหว่างวิลและสเตลล่าเหนียวแน่นขึ้น แต่รักครั้งนี้จะสมบูรณ์แบบได้อย่างไรในเมื่อทั้งสองไม่สามารถสัมผัสกันได้ วิลและสเตลล่าจึงขอใช้ทุกวินาทีรวบรวมความเข้มแข็งในจิตใจของตัวเองเพื่อส่งผ่านความรักที่จะไม่มีวันยอมปล่อยให้ระยะทาง “5 ฟุต” เป็นอุปสรรค',
        release_date: '18 เมษายน 2019',
        image:
          'https://cdn.majorcineplex.com/uploads/movie/2553/thumb_2553.jpg?1555621093',
        price: 180,
      },
    ];

    return (
      <div className="App">
        <Switch>
          <Route path="/purchase/confirm" component={MoviePurchaseConfirm} />
          <Route
            path="/detail/:id"
            component={props => <MovieDetail movies={data} {...props} />}
          />
          <Route
            path="/"
            component={props => <MovieList movies={data} {...props} />}
            exact
          />
          <Route path="*" component={NotFound} />
        </Switch>
      </div>
    );
  }
}

export default App;
